; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 - counter
	)
  (:init
		(= (value c0) 93)
	(= (value c1) 15)
	(= (value c2) 72)
	(= (value c3) 49)
	(= (value c4) 9)
	(= (value c5) 61)
	(= (value c6) 36)
	(= (value c7) 74)
	(= (value c8) 90)
	(= (value c9) 93)
	(= (value c10) 63)
	(= (value c11) 69)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 6 of 11
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 6 of 11
3. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 11
4. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 11
5. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 11
6. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 6 of 11
7. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 6 of 11
8. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 11
9. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 11
10. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 11
11. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 11
12. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 11
13. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 11
14. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 11
15. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 11
16. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 11
17. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 11
18. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 11
19. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 11
20. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 11
21. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 11
22. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 6 of 11
23. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 11
24. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 11
25. (increment c6)
   changed: (value c6) from 36 to 42
   goals met: 6 of 11
26. (increment c6)
   changed: (value c6) from 42 to 48
   goals met: 6 of 11
27. (increment c6)
   changed: (value c6) from 48 to 54
   goals met: 6 of 11
28. (increment c6)
   changed: (value c6) from 54 to 60
   goals met: 6 of 11
29. (increment c6)
   changed: (value c6) from 60 to 66
   goals met: 7 of 11
30. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 7 of 11
31. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 7 of 11
32. (increment c4)
   changed: (value c4) from 9 to 16
   goals met: 7 of 11
33. (increment c4)
   changed: (value c4) from 16 to 23
   goals met: 7 of 11
34. (increment c4)
   changed: (value c4) from 23 to 30
   goals met: 7 of 11
35. (increment c4)
   changed: (value c4) from 30 to 37
   goals met: 7 of 11
36. (increment c4)
   changed: (value c4) from 37 to 44
   goals met: 7 of 11
37. (increment c4)
   changed: (value c4) from 44 to 51
   goals met: 8 of 11
38. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 11
39. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 11
40. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 8 of 11
41. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 11
42. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 11
43. (increment c3)
   changed: (value c3) from 49 to 55
   goals met: 7 of 11
44. (increment c4)
   changed: (value c4) from 51 to 58
   goals met: 8 of 11
45. (increment c3)
   changed: (value c3) from 55 to 61
   goals met: 7 of 11
46. (increment c3)
   changed: (value c3) from 61 to 67
   goals met: 7 of 11
47. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 11
48. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 11
49. (increment c1)
   changed: (value c1) from 15 to 24
   goals met: 7 of 11
50. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 7 of 11
51. (increment c1)
   changed: (value c1) from 24 to 34
   goals met: 7 of 11
52. (increment c1)
   changed: (value c1) from 34 to 44
   goals met: 7 of 11
53. (increment c1)
   changed: (value c1) from 44 to 54
   goals met: 7 of 11
54. (increment c1)
   changed: (value c1) from 54 to 64
   goals met: 7 of 11
55. (increment c1)
   changed: (value c1) from 64 to 74
   goals met: 6 of 11
56. (increment c2)
   changed: (value c2) from 72 to 74
   goals met: 6 of 11
57. (increment c1)
   changed: (value c1) from 74 to 84
   goals met: 6 of 11
58. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 6 of 11
59. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 6 of 11
60. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 6 of 11
61. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 6 of 11
62. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 6 of 11
63. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 6 of 11
64. (increment c10)
   changed: (value c10) from 63 to 69
   goals met: 5 of 11
65. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 11
66. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 11
67. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 5 of 11
68. (increment c10)
   changed: (value c10) from 69 to 76
   goals met: 5 of 11
69. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 5 of 11
70. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 5 of 11
71. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 5 of 11
72. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 5 of 11
73. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 5 of 11
74. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 5 of 11
75. (decrement c10)
   changed: (value c10) from 76 to 66
   goals met: 6 of 11
76. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 6 of 11
77. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 6 of 11
78. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 6 of 11
79. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 6 of 11
80. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 6 of 11
81. (decrement c9)
   changed: (value c9) from 93 to 84
   goals met: 5 of 11
82. (increment c3)
   changed: (value c3) from 67 to 73
   goals met: 5 of 11
83. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 5 of 11
84. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 5 of 11
85. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 5 of 11
86. (decrement c2)
   changed: (value c2) from 74 to 72
   goals met: 6 of 11
87. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 11
88. (decrement c9)
   changed: (value c9) from 84 to 75
   goals met: 6 of 11
89. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 6 of 11
90. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 6 of 11
91. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 6 of 11
92. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 6 of 11
93. (increment c9)
   changed: (value c9) from 75 to 85
   goals met: 6 of 11
94. (decrement c8)
   changed: (value c8) from 90 to 87
   goals met: 6 of 11
95. (decrement c8)
   changed: (value c8) from 87 to 84
   goals met: 7 of 11
96. (decrement c1)
   changed: (value c1) from 84 to 74
   goals met: 7 of 11
97. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 11
98. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 7 of 11
99. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 7 of 11
100. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 7 of 11
101. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 7 of 11
102. (increment c1)
   changed: (value c1) from 74 to 84
   goals met: 7 of 11
103. (decrement c0)
   changed: (value c0) from 93 to 88
   goals met: 7 of 11
104. (decrement c0)
   changed: (value c0) from 88 to 83
   goals met: 8 of 11
105. (decrement c1)
   changed: (value c1) from 84 to 74
   goals met: 7 of 11
106. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 8 of 11
107. (decrement c0)
   changed: (value c0) from 83 to 78
   goals met: 8 of 11
108. (decrement c0)
   changed: (value c0) from 78 to 73
   goals met: 8 of 11
109. (decrement c0)
   changed: (value c0) from 73 to 68
   goals met: 8 of 11
110. (decrement c0)
   changed: (value c0) from 68 to 63
   goals met: 9 of 11
111. (increment c4)
   changed: (value c4) from 58 to 68
   goals met: 8 of 11
112. (increment c5)
   changed: (value c5) from 61 to 64
   goals met: 8 of 11
113. (increment c5)
   changed: (value c5) from 64 to 67
   goals met: 7 of 11
114. (increment c6)
   changed: (value c6) from 66 to 72
   goals met: 8 of 11
115. (increment c5)
   changed: (value c5) from 67 to 70
   goals met: 9 of 11
116. (decrement c3)
   changed: (value c3) from 73 to 67
   goals met: 9 of 11
117. (decrement c2)
   changed: (value c2) from 72 to 69
   goals met: 9 of 11
118. (decrement c2)
   changed: (value c2) from 69 to 66
   goals met: 10 of 11
119. (increment c10)
   changed: (value c10) from 66 to 76
   goals met: 9 of 11
120. (increment c10)
   changed: (value c10) from 76 to 86
   goals met: 10 of 11
121. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 10 of 11
122. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 10 of 11
123. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 10 of 11
124. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 10 of 11
125. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 10 of 11
126. (increment c11)
   changed: (value c11) from 69 to 75
   goals met: 10 of 11
127. (increment c11)
   changed: (value c11) from 75 to 81
   goals met: 10 of 11
128. (increment c11)
   changed: (value c11) from 81 to 87
   goals met: 11 of 11
